xml/data/BasicHttpBinding_USCOREDataServiceSoap.SendAsMail.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/"
 xmlns:ns5="http://schemas.datacontract.org/2004/07/Medius.Gemini.ClientModel"
 xmlns:ns6="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
 xmlns:ns3="DomainServices"
 xmlns:ns1="http://tempuri.org/">
 <SOAP-ENV:Body>
   <ns1:SendAsMail>
    <ns1:task>
     <ns5:Action></ns5:Action>
     <ns5:ActionId>0</ns5:ActionId>
     <ns5:AttachmentCount>0</ns5:AttachmentCount>
     <ns5:AvailableActions>
      <ns5:TaskAction>Authorize</ns5:TaskAction>
      <ns5:TaskAction>Authorize</ns5:TaskAction>
      <!-- extensibility element(s) -->

     </ns5:AvailableActions>
     <ns5:CommentCount>0</ns5:CommentCount>
     <ns5:Company></ns5:Company>
     <ns5:CompanyId>0</ns5:CompanyId>
     <ns5:CurrencyCode></ns5:CurrencyCode>
     <ns5:DueDate>2011-04-08T07:12:26Z</ns5:DueDate>
     <ns5:ExternalCompanyId></ns5:ExternalCompanyId>
     <ns5:FlagColor></ns5:FlagColor>
     <ns5:FlagDescription></ns5:FlagDescription>
     <ns5:InvoiceDate>2011-04-08T07:12:26Z</ns5:InvoiceDate>
     <ns5:InvoiceId>0</ns5:InvoiceId>
     <ns5:InvoiceNumber></ns5:InvoiceNumber>
     <ns5:IsReviewResponsible>false</ns5:IsReviewResponsible>
     <ns5:LanguageId>0</ns5:LanguageId>
     <ns5:LastUserFirstName></ns5:LastUserFirstName>
     <ns5:LastUserLastName></ns5:LastUserLastName>
     <ns5:Status></ns5:Status>
     <ns5:Supplier></ns5:Supplier>
     <ns5:TaskId>0</ns5:TaskId>
     <ns5:TotalAmount></ns5:TotalAmount>
     <ns5:UserId>0</ns5:UserId>
     <ns5:WorkflowName></ns5:WorkflowName>
     <!-- extensibility element(s) -->

    </ns1:task>
    <ns1:mailTo></ns1:mailTo>
    <ns1:mailSubject></ns1:mailSubject>
    <ns1:mailBody></ns1:mailBody>
   </ns1:SendAsMail>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
